Problem 1: Create a pandas Series and solve the following tasks:

Create a Series from a list [10, 20, 30, 40, 50].

Create a Series with custom indices ['a', 'b', 'c', 'd', 'e'].

Retrieve the value at index 'c'.

Problem 2: Create a DataFrame and perform simple operations:

Create a DataFrame with the following data:

Name    Age   City

John    25    New York

Alice   30    Los Angeles

Bob     22    Chicago

Retrieve:
The column Name.

The row where Age is 30.

3. CSV - Input and Output

Problem 3: Read a CSV file into a pandas DataFrame:

Download this sample CSV file:

Sample File link -https://people.sc.fsu.edu/~jburkardt/data/csv/airtravel.csv

Load the CSV file into a DataFrame.

Display the first 5 rows.

4. Filtering DataFrame - Conditions

Problem 4: Use filters in pandas:

Filter rows in the DataFrame where Age > 25.

5. Aggregations - Mean and Count

Problem 5: Perform aggregations:

Calculate:

The average Age.

The number of rows where City is 'New York'.

Problem 6: Sort the DataFrame by Age in descending order.

7. Adding a New Column

Problem 7: Add a new column to the existing DataFrame:

Add a column Salary with values [50000, 70000, 45000].

In [16]:
import pandas as pd

In [25]:
d1=[10,20,30,40,50]
index=['a','b','c','d','e']
vr=pd.Series(d1,index=index)
vr['c']

30

In [28]:
d1={"Name":["John","Alice","Bob"],
"Age":[25,30,22],
"City":["New York","Los Angeles","Chicago"]}
vr=pd.DataFrame(d1)
vr["Name"]

0     John
1    Alice
2      Bob
Name: Name, dtype: object

In [32]:
vr.query("Age==30")

    Name  Age         City
1  Alice   30  Los Angeles

In [3]:
import pandas as pd
vr=pd.read_csv("airtravel.csv")
vr.head(5)

  Month   "1958"   "1959"   "1960"
0   JAN      340      360      417
1   FEB      318      342      391
2   MAR      362      406      419
3   APR      348      396      461
4   MAY      363      420      472

In [5]:
d1={"Name":["John","Alice","Bob"],
"Age":[25,30,22],
"City":["New York","Los Angeles","Chicago"]}
vr=pd.DataFrame(d1)
vr.query("Age>25") #Anwer for age >25

    Name  Age         City
1  Alice   30  Los Angeles

In [8]:
vr["Age"].mean()

25.666666666666668

In [19]:
m=vr["City"]=="New York"
m.value_counts()

City
False    2
True     1
Name: count, dtype: int64

In [14]:
vr["Age"].sort_values(ascending=False)

1    30
0    25
2    22
Name: Age, dtype: int64

In [15]:
salary=[50000,70000,45000]
vr["salary"]=salary